
#Область ПрограммныйИнтерфейс
// Обновляет сумму в строке табличной части документа на основе количества и цены.
//
// Параметры:
//   СтрокаТЧ - СтрокаТабличнойЧасти - строка табличной части документа, для которой необходимо 
//										обновить сумму. Должна содержать поля Цена, Количество, Сумма.
&НаКлиенте
Процедура ОбновитьСуммуВСтрокеТЧ(СтрокаТЧ) Экспорт
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
