
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Сумма = ТекущийОбъект.Товары.Итог("Сумма");
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьСуммуВСтрокеТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьСуммуВСтрокеТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Выберите склад'");
		Сообщение.ПутьКДанным = "Объект.Склад";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Склад", Объект.Склад);  
	Парам = Новый Структура("Отбор", Отбор);
    ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", Парам, Элементы.Товары); 
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
#КонецОбласти
