#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Сумма = ТекущийОбъект.Товары.Итог("Сумма");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьСуммуВСтрокеТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьСуммуВСтрокеТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры
#КонецОбласти
